{"title":"Global Day of Coderetreat 2014 - Padova, Italy","description":"Sei stanco di scrivere codice sotto pressione perchè si è sempre in ritardo con le consegne? Hai la sensazione di non avere mai tempo per migliorare il modo in cui scrivi codice perchè sei sempre intento a scriverlo? Ti senti un artigiano del software incompreso che viene trattato da operaio del computer?\n \n Immagina la quantità di spunti e riflessioni che potresti raccogliere in un giorno in cui non dovrai preoccuparti di consegnare (anzi butterai via il codice che scriverai), ti potrai concentrare sulle regole del buon design (http://c2.com/cgi/wiki?XpSimplicityRules) e confrontarti con esperienze e linguaggi di programmazione diversi.\n \n Iscriviti subito al CodeRetreat (maggior info le trovi qui http://archive.coderetreat.org/) di Padova, e partecipa alla giornata mondiale dedicata alla passione per il software! La macchina organizzativa è già in fermento. Abbiamo appena aperto le iscrizioni e sono limitate a soli 20 posti al costo 10 euro comprensivi di colazione e pranzo. \nIl tutto si svolgerà in TalentGarden a Padova! \n-- \nIl Global Day of Coderetreat è un evento internazionale che celebra la passione per la software craftsmanship. \nL'anno scorso più di 2000 developers da 150 città in tutto il mondo hanno dedicato un giorno alla pratica deliberata dello sviluppo software, e quest'anno per la prima volta ci sarà anche Padova (http://archive.coderetreat.org/events/global-day-of-coderetreat-2013-padova-italiy). \nCi troviamo puntuali alle 9:00 presso TBD per la colazione, e dopo una breve introduzione inizieremo le sessioni. Durante ogni sessione si lavorerà in pair programming per sviluppare in TDD il Game of Life di Conway con un linguaggio qualsiasi scelto indipendentemente da ciascuna coppia. Alla fine di ogni sessione il codice sarà cancellato e ci riunieremo per una breve retrospettiva.  \nSe pensi che l'esercizio sia troppo semplice e/o noioso, significa che non hai mai partecipato a un coderetreat: vieni e scopri quante variazioni interessanti sono in serbo per te! :)","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-coderetreat-2014-padova-italy","spoken_language":"","moderators":[{"name":"Francesco Levorato"}],"location":{"country":"Italy","city":"Padova","coordinates":{"latitude":45.4064349,"longitude":11.8767611}},"date":{"start":"2014-11-15T09:00:00+02:00","end":"2014-11-15T16:00:00+02:00"}}
