{"title":"Global Day of Code Retreat 2016 - San Francisco, US","description":"Registration: https://www.meetup.com/San-Francisco-Software-Craftsmanship/events/234610700/\n \n Global Day of Code Retreat is an annual event where craftspeople from all around the world gather together to practice their craft. Last year the event attracted over 2000 developers from around 150 cities around the globe. In 2016 the event will happen on October 22nd. We will start at 8.30 AM and conclude by 5 PM, of course with the option to end the day with a few drinks. So bring your own laptops, configured with your favorite IDEs and programming languages and come join us for a full day of practice, learning and fun. Light breakfasts, lunch and refreshments will be provided.\n \n For those of you who are not familiar with code retreats, I copied below some of the information from coderetreat.org.\n \n A Code Retreat is a day-long, intensive practice event, focusing on the fundamentals of software development and design.\n \n By providing developers the opportunity to take part in focused practice, away from the pressures of 'getting things done', the code retreat format has proven itself to be a highly effective means of skill improvement. Practicing the basic principles of modular and object-oriented design, developers can improve their ability to write code that minimizes the cost of change over time.\n \n A code retreat has an established, time-tested format that is optimized for focused practice.\n \n Structure:\n Length of Session: 45 minutes\n Duration: 8.30am to 5 or 6pm\n Pair-programming is necessary, as the knowledge transfer contained in that activity is essential to the practice\n Prefer using Test-Driven Development (TDD)\n After each session, pairs should be swapped\n After each session, code must be deleted, not put in a branch, not stashed, just deleted with no trace left\n \n The code retreat day consists of 5-6 sessions, each session's learnings building upon previous sessions. The morning focuses on becoming comfortable with the problem domain, breaking old habits and beginning focused self-discovery. The afternoon pushes the envelope by challenging pairs to stretch their skills and understanding of abstractions, modular design and test-driven development.\n \n More information\n \n Video explaining the format: http://archive.coderetreat.org/about\n http://globalday.coderetreat.org/","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-code-retreat-2016-san-francisco-us","spoken_language":"","moderators":[{"name":"Bogdan Dumitrescu"}],"location":{"country":"United States of America","city":"San Francisco","coordinates":{"latitude":37.7749295,"longitude":-122.4194155}},"date":{"start":"2016-10-22T09:00:00-07:00","end":"2016-10-22T16:00:00-07:00"}}
