[
  {
    "author": "Raimo Radczewski",
    "datePosted": "September 21, 2016 at 8:00pm",
    "slug": "celebrating-100-gdcr-events-all-over-the-world-with-a-special-sur",
    "title": "Celebrating 100 GDCR Events all over the world with a special surprise",
    "bodyShort": "Hey everyone, we're celebrating the first hundred locations for the Global Day Of Coderetreat 2016 (psst, it's on Oct 22nd!) and we're really excited to reveal a little surprise we prepared for the community: <strong>Our new Logo!</strong> The Global Day of Coderetreat is an opportunity for",
    "bodyLong": "<p>Hey everyone, we're celebrating the first hundred locations for the Global Day Of Coderetreat 2016 (psst, it's on Oct 22nd!) and we're really excited to reveal a little surprise we prepared for the community:</p>
          <strong>Our new Logo!</strong>
          <p>
            <a href='http://api.ning.com:80/files/jSNhDxbJzkhXrrY0iRpH6BcVvhI*gxlw8omnpCMeGIbJPEBP6nkR*bZZpyI5nntSQEqOUPH*Oq8w8q3GW00f01l37OPmLcLO/globaldayiso1.ai.png' target='_self'><img src='http://api.ning.com:80/files/jSNhDxbJzkhXrrY0iRpH6BcVvhI*gxlw8omnpCMeGIbJPEBP6nkR*bZZpyI5nntSQEqOUPH*Oq8w8q3GW00f01l37OPmLcLO/globaldayiso1.ai.png?width=300' width='300' class='align-center'></a>
          </p>
          <p>The Global Day of Coderetreat is an opportunity for developers to gather together and practice their craft. Our new logo represents four people joining a discussion circle. This expresses the value and camaraderie&nbsp;that comes from the exchange
            of methods and ideas. (thanks&nbsp;<a href='https://twitter.com/mplavcan' target='_blank'>Matt</a>&nbsp;for that excellent explanation)</p>
          <p>We'd like to thank <a href='http://smartviewapp.com/'>SmartView</a> for kindly sponsoring the Logo and <a href='https://twitter.com/abarylko'>Amir Barylko</a> who went through a lot of revisions with us :)</p>
          <p>To the next one hundred locations!</p>"
  },
  {
    "author": "Ivan Kusalic",
    "datePosted": "July 23, 2016 at 4:11pm",
    "slug": "how-to-participate-in-the-global-day-of-coderetreat-2016",
    "title": "How to participate in the Global Day of Coderetreat 2016",
    "bodyShort": "The <strong>Saturday, October 22nd</strong> is getting closer and with it the Global Day of Coderetreat 2016. It's now the time to consider how you'll participate in the event. Here are the possibilities:<br><br> You can <strong>participate</strong>        in a local coderetreat and freeing yourself to experiment and try new techniques, learning from each other, writing the best code you can by focusing on some basic principles of well-written code and challenging many of our everyday",
    "bodyLong": "<p>The <strong>Saturday, October 22nd</strong> is getting closer and with it the Global Day of Coderetreat 2016. It's now the time to consider how you'll participate in the event. Here are the possibilities:<br> <br> You can <strong>participate</strong>            in a local coderetreat and freeing yourself to experiment and try new techniques, learning from each other, writing the best code you can by focusing on some basic principles of well-written code and challenging many of our everyday assumption.
            Interested? Information about local events will be published on the&nbsp;<a href='http://gdcr.coderetreat.org/' target='_blank'>GDCR Website</a> and the <a href='http://coderetreat.org/events/event/listByType?type=gdcr16' target='_self'>coderetreat.org events section</a>.<br>            <br> You want to help others enjoy GDCR and raise the bar in our industry? You should organize a local event.<br> <br> You can <strong>host</strong> a coderetreat of your own in your city. Hosts handle all of the logistics of organizing, finding
            a local sponsor, running a coderetreat and creating an atmosphere of fun and collaboration. Don't worry if you haven't hosted a coderetreat yet. We are here to support you and we will provide you many resources to help you organize an amazing
            event. If you are interested in hosting a coderetreat in your city for GDCR 2016, please submit <a href='http://goo.gl/forms/Px0ytk6ZS7ZQAdew1' target='_blank'>this form</a> and we will add you to the facilitator/host mailing lists where you
            can get help from other facilitators and hosts from around the world.<br> <br> Every coderetreat needs a <strong>facilitator</strong> as well. Facilitators guide participants through the exercises and lead the retrospectives. Don't worry if
            you haven't facilitated a coderetreat yet. We are here to support you! We will provide you with resources and online training sessions. If you are interested in facilitating a coderetreat event in your city for GDCR 2016,&nbsp;please submit
            <a href='http://goo.gl/forms/Px0ytk6ZS7ZQAdew1' target='_blank'>this form</a> and we will add you to the facilitator/host mailing lists where you can get help from other facilitators and hosts from around the world.<br> <br> We are currently
            preparing trainings for hosts and facilitators for GDCR 2016. Stay tuned by following&nbsp;<a href='https://twitter.com/coderetreat' target='_blank'>@coderetreat</a> and the&nbsp;<a href='https://twitter.com/search/?q=%23gdcr16' target='_blank'>#gdcr16 hashtag</a>            on Twitter and join us in numerous training sessions.</p>
          <p>There is also a&nbsp;<a href='https://softwarecraftsmanship.slack.com/messages/gdcr/' target='_blank'>#gdcr channel</a> at&nbsp;<a href='http://slack.softwarecraftsmanship.org/' target='_blank'>Software Craftsmanship Slack</a> where you can
            ask for help and advice and in general discuss anything related to GDCR.</p>
          <p>We hope you are looking forward to GDCR 2016 as much as we are. :)</p>"
  },
  {
    "author": "Liao Chunbo",
    "datePosted": "April 25, 2016 at 1:00am",
    "slug": "the-first-global-day-of-coderetreat-in-nokia-cd-site",
    "title": "2016 Q1 Nokia Chengdu TC Code Retreat Day",
    "bodyShort": "I'm very excited to share the experience about '2016 Q1 Chengdu TC Code Retreat Day'! The 2016 Q1 Nokia Chengdu TC Code Retreat Day was hold on Saturday, March 19! For some reason,I did not share it immediately. I would like to share with you about this activity: we made it successfully and enjoy it. It is my privilege to be the facilitator of the Code Retreat Day in Nokia Chengdu site. For I have limit experience on this, I learned some experience from Harry (last year’s",
    "bodyLong": "<p>I'm very excited to share the experience about '2016 Q1 Chengdu TC Code Retreat Day'!</p>
        <p>The 2016 Q1 Nokia Chengdu TC Code Retreat Day was hold on Saturday, March 19! For some reason,I did not share it immediately. I would like to share with you about this activity: we made it successfully and enjoy it.</p>
        <p>It is my privilege to be the facilitator of the Code Retreat Day in Nokia Chengdu site. For I have limit experience on this, I learned some experience from Harry (last year’s facilitator of GDCR) and made the agenda.</p>
        <p>There were 14 participants from different companies participated this event. Consider most of us did not have much experience, ‘Monty Hall’ was chosen as our KATA.</p>
        <p>To implement this KATA, we chose pair programming and each of us using the programming language which our teammate good at. We divided The Code Retreat into 4 sessions and the programming cheerleader prepared some interesting games for each.</p>
        <strong>Session 1 - Requirement analysis:</strong>
        <p>The rule is each pair has 30 minutes to discuss the same requirement and 5 minutes to represent the conclusion. The purpose of this session is learn to understand requirement from different perspectives. During this session, we had a heated discussion
          and learned the methodology about how to see things in a better way.</p>
        <strong>Session 2 – Implementation:</strong>
        <p>In this session, we regrouped the pair (one tester and one developer) and started to implement the KATA in the usual way. For the limited of time, only the coding was done, we didn’t finish the rest part of the implementation.</p>
        <strong>Session 3 – TDD:</strong>
        <p>TDD is an efficient way in agile development. The purpose of this session is to make us know more about the benefit of TDD. I spent 5 minutes to do the introduction and this time we implemented the KATA in TDD way. The result is quite fascinating.
          All pairs finished the task nicely and we all felt the magic of TDD. Most of the participants would like to consider using TTD in their daily work.</p>
        <strong>Session 4 – Constraints:</strong>
        <p>Following is the constraints I made in the session:</p>
        <ol>
          <li>Making a test list.</li>
          <li>Keyboard only.</li>
          <li>Using a plain text editor.</li>
          <li>Small method.</li>
          <li>No loops.</li>
        </ol>
        <p>I didn’t expect to use all above constraints and they made amazingly with all of those constraints.</p>
        <p>In the end, we all felt that the “2016 Q1 Nokia Chengdu TC Code Retreat Days” is “Happy”, “Passion”, “Surprise” and “Unforgettable”.</p>
        <p>Hereby, I would like to express my thanks to Hebe and Xirui for their great support, also those who participated this event.</p>
        <p>Best wishes to you and see you next time.</p>"
  },
  {
    "author": "Ivan Kusalic",
    "datePosted": "April 9, 2016 at 4:30pm",
    "slug": "announcing-global-day-of-coderetreat-2016",
    "title": "Announcing Global Day of Coderetreat 2016",
    "bodyShort": "We are excited to announce the date for the Global Day of Coderetreat 2016!
      This year GDCR will happen on <strong>Saturday, October 22nd</strong>!
      Thousands of developers all around the globe will get together on the same day to improve skills, share knowledge, practice together and generally have great time in a safe and fun environment.
      Last year, we had around 150 Coderetreats and 2,000 participants all over the globe joining us for the Global Day of Coderetreat. This",
    "bodyLong": "<p>We are excited to announce the date for the Global Day of Coderetreat 2016!</p>
        <p>This year GDCR will happen on <strong>Saturday, October 22nd</strong>!</p>
        <p>Thousands of developers all around the globe will get together on the same day to improve skills, share knowledge, practice together and generally have great time in a safe and fun environment.</p>
        <p>Last year, we had around 150 Coderetreats and 2,000 participants all over the globe joining us for the Global Day of Coderetreat. This year we hope to have even more!</p>
        <p>What is a coderetreat? Coderetreat is a day&shy;-long, intensive practice event focusing on the fundamentals of software development and design. The coderetreat format has proven itself to be a highly effective means of skill improvement by providing
          developers the opportunity to take part in focused practice away from the pressures of 'getting things done.' For more information, check out the <a href='http://gdcr.coderetreat.org/' target='_blank'>GDCR website</a>.</p>
        <p>GDCR 2016 Edition will be brought to you by hundreds of passionate local facilitators worldwide and a team of global coordinators, including <a href='https://twitter.com/jthurne' target='_blank'>Jim Hurne</a>,&nbsp;<a href='https://twitter.com/alinpandichi' target='_blank'>Alin Pandichi</a>,&nbsp;<a href='https://twitter.com/rradczewski' target='_blank'>Raimo Radczewski</a>,&nbsp;<a href='https://twitter.com/srbiv' target='_blank'>Stafford Brooke</a> and <a href='https://twitter.com/ikusalic' target='_blank'>Ivan Kusalic</a>.</p>
        <p>Over the next couple of weeks, we will have more information about taking part in Global Day of Coderetreat 2016. Stay tuned by following&nbsp;<a href='https://twitter.com/coderetreat' target='_blank'>@coderetreat</a> and the&nbsp;<a href='https://twitter.com/search/?q=%23gdcr16' target='_blank'>#gdcr16 hashtag</a> on Twitter.</p>
        <p>Hope you are as excited as we are and are looking forward to an amazing event! <strong>Don't forget</strong> to add October 22nd to your calendars and spread the word.</p>
        <p>May the Cells be with you!</p>
        <p><strong><img src='https://lh3.googleusercontent.com/AXQI_kdSgso4BAo6gtAomkKsX6Auzg4lU0_sFAO-MpFCtuJn6NVUODRzEfetYB_l1wE3mOXQDpOuq1xXPrziZLM8pt2YF6ZQEGnRYqwVhr8uXxYncConlOE2qlgdXCZsKw' height='79px;' width='79px;'></strong></p>"
  },
  {
    "author": "Bob Allen",
    "datePosted": "October 13, 2015 at 11:00pm",
    "slug": "http://localhost:4000/blogs/three-simulations-in-one-45-min-sprint",
    "title": "Three Simulations in One 45 Min Sprint",
    "bodyShort": "We run 45 minute 'sprints' where pairs choose a kata to work on using ping-pong or pilot-navigator pairing, and follow each sprint with a short retrospective. For this exercise I ask everyone to agree on a single language, or choose from among two languages that everyone is OK with, and a single non-trivial kata, i.e. everyone solving the same problem. We also use cyber-dojo.org to level the playing field for all as regards an IDE",
    "bodyLong": "<p>We run 45 minute 'sprints' where pairs choose a kata to work on using ping-pong or pilot-navigator pairing, and follow each sprint with a short retrospective. For this exercise I ask everyone to agree on a single language, or choose from among
          two languages that everyone is OK with, and a single non-trivial kata, i.e. everyone solving the same problem. We also use cyber-dojo.org to level the playing field for all as regards an IDE.</p>
        <ul>
          <p>1. Start a timer after everyone has sorted themselves out (paired and begun). Set the timer for 10 minutes.</p>
          <p>2. At the end of ten minutes (remember, they were expecting to have 45 minutes), ask everyone to stand and each pair move together to the next station to their right. They are now taking over the other pair's code base.</p>
          <p>3. Start a timer, again for 10 minutes. At the end of ten minutes, repeat the instructions exactly; everyone rotates, moving with their original pair to the next workstation/laptop.
            <br><u>Purpose</u>: These two rotation obviously give participants a sense of what it means to take responsibility for a new-in-every-sense code base.</p>
          <p>4. Start a timer once again for 10 minutes. When it expires have everyone return to&nbsp;<i>where they started</i>.&nbsp;
            <br><u>Purpose</u>: This simulates the 'What have they do to our/my code?'&nbsp;
            </p><p> 5. As timer expires, have&nbsp;<i>just 1 member of each pair&nbsp;</i>move to any workstation/laptop where they have not been previously.
              <br><u>Purpose</u>: This simulates having to explain to a new team member how everything works, even when not all of the code is yours, sort of a joint discovery, complete with some exposed vulnerability.</p>
        </ul>
        <p>I've used variations of the above many times, and used it exactly as described just last weekend. The retrospective revealed exactly what you would expect: the long-time developers and consultants totally got it. The newer folks had their eyes
          forced wide open. Craftsmanship isn't all unicorns and rainbows.</p>"
  },
  {
    "author": "Bob Allen",
    "datePosted": "September 2, 2015 at 5:22pm",
    "slug": "http://localhost:4000/blogs/enabling-constraints",
    "title": "Enabling constraints",
    "bodyShort": "Reading a tweet by @mattbarcomb&nbsp;led me to this post: '<a rel='nofollow' href='http://dancingwithelephants.ca/tag/enabling-constraints/' target='_blank'>Enabling constraints are about opening possibilities by limiting choices.</a>' a short read.&nbsp;#CodeRetreat
        facilitators&nbsp;use this, and <em>have fun</em> doing it!
      Also, '<a rel='nofollow' href='https://vimeo.com/128934608' target='_blank'>Constraints that Enable Innovation - Alicia Juarrero'</a>, Professor Emerita of Philosophy at Prince George’s",
    "bodyLong": "<p>Reading a tweet by @mattbarcomb&nbsp;led me to this post: '<a rel='nofollow' href='http://dancingwithelephants.ca/tag/enabling-constraints/' target='_blank'>Enabling constraints are about opening possibilities by limiting ch...</a>' a short read.&nbsp;Coderetreat
          facilitators&nbsp;use this, and <em>have fun</em> doing it!</p>
        <p>Also, '<a rel='nofollow' href='https://vimeo.com/128934608' target='_blank'>Constraints that Enable Innovation'</a> - Alicia Juarrero, Professor Emerita of Philosophy at Prince George’s Community College (MD) on 'enabling' innovation.
          Overflowing with great stuff on the fundamentals of natural learning.</p>
        <p><br>Notable quote:<br>'Take the system far from equilibrium. Nothing interesting ever happens at equilibrium.'</p>
        <p>Texas version: 'There's Nothing in the Middle of the Road but Yellow Stripes and Dead Armadillos.' I'll leave the sourcing as an excise for the reader.</p>"
  },
  {
    "author": "Bob Allen",
    "datePosted": "July 20, 2015 at 11:00pm",
    "slug": "http://localhost:4000/blogs/self-organizing-team-2-footballs",
    "title": "Self Organizing Team #2 - Footballs",
    "bodyShort": "Below is a handout that was given at the beginning of the day. A second handout was given just after lunch. Together they define an exercise designed to require teams to work out and demonstrate these skills:
      <ol>
        <li>Self organization of teams when given full reign (and full responsibility).</li>
        <li>How to work with what you're given, even when extremely sparse.</li>
        <li>How to deliver <em>iteratively (MVP)</em>.</li>
        <li>How to keep parts of the solution decoupled from one another.</li>
      </ol>",
    "bodyLong": "<p>Below is a handout that was given at the beginning of the day. A second handout was given just after lunch. Together they define an exercise designed to require teams to work out and demonstrate these skills:</p>
        <ol>
          <li>Self organization of teams when given full reign (and full responsibility).</li>
          <li>How to work with what you're given, even when extremely sparse.</li>
          <li>How to deliver <em>iteratively (MVP)</em>.</li>
          <li>How to keep parts of the solution decoupled from one another.</li>
        </ol>
        <p>&lt;Handout #1 - Morning session&gt;</p>
        <p class='p1' style='text-align: center;'><b>Welcome to the BBC - Part I</b></p>
        <p class='p3'>Welcome to the BBC - The “Bouncy Ball Company”. You have been selected to join the newly formed Super Hot Automation Facilitation Team, SHAFT for short.</p>
        <p class='p3'>The focus of this team is to outcompete <em>every other manufacturer</em> by building software that will automate every step in the manufacture of most any sort of ball, starting with the most popular product here in the northeast; the football
          (American NFL football).</p>
        <p class='p3'>Manufacturing overview reference: <a rel='nofollow' href='http://www.madehow.com/Volume-3/Football.html'>http://www.madehow.com/Volume-3/Football.html</a></p>
        <p class='p3'>For the bill of materials and manufacturing steps, see the link above:</p>
        <p class='p3'>Forms teams, possibly based on the stages of the manufacturing process, and be sure to remain agile. More news later.</p>
        <p class='p3'>The first half of the day (pre-lunch) will be devoted to <span class='s1'><b><i>iterating</i></b></span> and improving the process with at least three deliveries, each accompanied by a customer review and feedback.</p>
        <p>&lt;end Handout #1 - Morning session&gt;</p>
        <p style='text-align: center;'><strong>LUNCH</strong></p>
        <p>&lt;Handout #2 - Afternoon session&gt;</p>
        <p class='p1' style='text-align: center;'><b>Welcome to the BBC - Part II</b></p>
        <p class='p2'>Start manufacturing soccer balls. The requirement is to apply all the learning that went into making footballs to now making soccer balls, maximizing the automation by maximizing parameterization, and minimizing waste of the raw materials.</p>
        <p class='p1'><span class='s1'>Manufacturing overview reference: <a rel='nofollow' href='http://www.madehow.com/Volume-5/Soccer-Ball.html'><span class='s2'>http://www.madehow.com/Volume-5/Soccer-Ball.html</span></a>
          </span>
        </p>
        <p class='p3'>As you may have surmised by now, the <i>real</i> exercise is about teamwork, both within teams and <i>across</i> teams, and <i>rapidly</i> finding out what works for the people who show up.</p>
        <p>&lt;end Handout #2 - Afternoon session&gt;</p>
        <p>Here's what happened:</p>
        <p>The morning was predictably defined by lots of questions -<br> -- What constitutes 'acceptance'?.<br> -- How will we divide the work up?'<br> -- How will me track progress?</p>
        <p>The answers were much simpler than attendees imagined:<br> -- Ask the customer what is acceptable, and a rank-ordered list of what comes first, second, etc.<br> -- Organization is entirely up to the team(s).<br> -- Deliver working (acceptable)
          software.
        </p>
        <p>The afternoon session raised the bar on agility at both the testing and implementation&nbsp;levels:</p>
        <ul>
          <li><span style='text-decoration: underline;'>Similarities</span>: Both balls have an inner bladder, are inflated with a given quantity of air, required a valve to inflate the bladder, and require a stitched-together outer skin of&nbsp;n faces which
            has to be printed on (e.g. the logo, serial #, etc.)</li>
          <li><span style='text-decoration: underline;'>Differences</span>: The specification (diameter, width, length, lacing or not, number of outer layer faces, shapes of the faces, number of different face shapes, weight, etc.) varied.</li>
        </ul>
        <p>The outcomes I was most pleased with were that&nbsp;18 peoples who do not work together, all of who met at this monthly workshop ...</p>
        <ul>
          <li>collaborated rather than competing,</li>
          <li>natural leaders emerged quickly and at different points during the day,</li>
          <li><em>everyone</em> participated and remained engaged for the entire day.</li>
        </ul>"
  },
  {
    "author": "Alin Pandichi",
    "datePosted": "July 15, 2015 at 10:14am",
    "slug": "http://localhost:4000/blogs/ready-for-the-2015-global-edition",
    "title": "Ready for the 2015 Global Edition?",
    "bodyShort": " We are very excited to announce this year's Global Day of Coderetreat!
      On <strong>Saturday, November 14th, 2015</strong>, thousands of developers all over the globe will join us to honour our craft, share knowledge, and practice by “playing our instruments behind the scenes” to learn from each other.
      Last year, about 150 Coderetreats and 2,000 participants all over the globe joined us for the Global Day of Coderetreat. This year we expect even more!",
    "bodyLong": ""
  },
  {
    "author": "",
    "datePosted": "",
    "slug": "",
    "title": "",
    "bodyShort": "",
    "bodyLong": ""
  },
  {
    "author": "",
    "datePosted": "",
    "slug": "",
    "title": "",
    "bodyShort": "",
    "bodyLong": ""
  },
  {
    "author": "",
    "datePosted": "",
    "slug": "",
    "title": "",
    "bodyShort": "",
    "bodyLong": ""
  },
  {
    "author": "",
    "datePosted": "",
    "slug": "",
    "title": "",
    "bodyShort": "",
    "bodyLong": ""
  },
  {
    "author": "",
    "datePosted": "",
    "slug": "",
    "title": "",
    "bodyShort": "",
    "bodyLong": ""
  },
  {
    "author": "",
    "datePosted": "",
    "slug": "",
    "title": "",
    "bodyShort": "",
    "bodyLong": ""
  },
  {
    "author": "",
    "datePosted": "",
    "slug": "",
    "title": "",
    "bodyShort": "",
    "bodyLong": ""
  },
  {
    "author": "",
    "datePosted": "",
    "slug": "",
    "title": "",
    "bodyShort": "",
    "bodyLong": ""
  },
  {
    "author": "",
    "datePosted": "",
    "slug": "",
    "title": "",
    "bodyShort": "",
    "bodyLong": ""
  },

]
