{"title":"Global Day of Coderetreat 2013 - (Spitalfields) London, UK","description":"Unruly is hosting a Global Day Coderetreat 2013 at our offices in London. We use XP every day so have a really nice space for pair programming. \nFacilitator: Steve Tooke \nGlobal Day of Coderetreat is a world-wide event celebrating passion and software craftsmanship. Last year, over 1800 passionate software developers in 94 cities around the world spent the day practicing the craft of software development using the coderetreat format. This year,200 cities from all over the world will host such events. Since our community pioneered code retreats in Europe, we are glad to continue this tradition.  \nWhat's it about? \nDuring a code retreat we use pair-programming, to learn from each other. We write our code using Test-Driven Development while applying design principles to produce clean code. Our focus is on learning and there's no pressure to produce a working solution for the problem. \nThe format of a code retreat is:  \n \n Problem: Conway’s Game of Life\n   \n   45 mins write the best code with your pair \n   delete your code (yes, it can be hard) \n   10 minutes retrospectives \n   5 minutes break \n   change your pair  \n    \n We have 2-3 coding sessions in the morning \n Break for lunch around 1pm \n 2-3 more coding sessions in the afternoon. \n At the end, we'll have a longer retrospective \n \nThis code retreat is language agnostic, the main principles are the same for each language. We're hoping to setup some of our pairing workstations for use by code retreat participants but please feel free to bring your own laptop if you have a specific language and IDE that you'd like to use. \nPlease aim to arrive by 9am so we can start coding at 9:30am. Lunch and refreshments will be provided. \nAbout the organisers \nUnruly (http://unrulymedia.com/) are hosting this retreat because we use XP practices everyday and would like to encourage developers to learn more about how much fun it is to work this way. We're always on the lookout for great people to join our team. \nAbout our facilitator \nSteve Tooke (http://kickstartacademy.io/team#tooky) is an independent programmer, trainer and coach. Passionate about improving his craft and helping others improve theirs. He specialises in helping teams produce business value continuously through improving communication and keeping their code maintainable. BDD is at the core of this process.  \nFree registration via Eventbrite (http://gdcr13unruly.eventbrite.co.uk/)","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-coderetreat-2013-spitalfields-london-uk","spoken_language":"","moderators":[{"name":"Rachel Davies"}],"location":{"country":"United Kingdom","city":"(Spitalfields) London","coordinates":{"latitude":51.5196978,"longitude":-0.07569210000000001}},"date":{"start":"2013-12-14T09:00:00+01:00","end":"2013-12-14T17:00:00+01:00"}}
