{"title":"Global Day of Coderetreat 2013 - Vienna, Austria","description":"Since we started with the first Global Day of Coderetreat in 2011 Vienna already has a vivid crowd of software craftsmen, which is key for great companies and products, fit for the future. Software craftsmanship is the missing link many of us often even miss in so called Agile projects.\n \n This year we have Peter Kofler as facilitator on board. Peter probably is the most experienced facilitator for Coding Dojos and Coderetreats around Vienna at the moment. He just did his journeyman tour and many different facilitations as well as public talks. So your chances to learn great stuff at our event are tremendous. And of course it will be great fun too!\n \n Want to join as participant? Get your ticket here (it's free, we just ask for a deposit, which will be returned immediately to those showing up) -http://gdcr13-vienna.eventbrite.de (http://gdcr13-vienna.eventbrite.de/)\n Know others, your friends, peers at work, who might be interested too? Please, help spreading the word and tell them about our event.\n \n Want to see your company as sponsor? Please get in contact with us a toffice@agileexperts.at (mailto:office@agileexperts.at?subject=GDCR13%20Vienna%20-%20Request%20for%20Sponsorship)\n \n Looking forward to seeing you at the GDCR13 Vienna!\n best, Mike Leber\n \n PS: we are currently in touch with 2-3 options for the location in Vienna and let you know soon about it.\n\nWas a great code retreat! Thanks for organizing this. Thanks all the sponsors for making this possible. Thanks Peter for facilitating. \nIt is great to meet like-minded developers also interested in improving professionally and making the most of themselves. \nIt is also a very productive place to practice coding, test-driven-development, learn, reflect, have new insights and have fun! \nLooking forward to the next one, to coding dojos, katas and pair-programming.","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-coderetreat-vienna-2014","spoken_language":"","moderators":[{"name":"Michael Mike Leber"}],"location":{"country":"Austria","city":"Vienna","coordinates":{"latitude":48.2081743,"longitude":16.3738189}},"date":{"start":"2013-12-14T08:30:00+02:00","end":"2013-12-14T17:00:00+02:00"}}
