{"title":"Global Day of Coderetreat 2013 - Karachi, Pakistan","description":"Calling fellow hackers,\n \n Active Capital IT is hosting a Global Code Retreat Day. What you get to do is:-\n Meet other like minded developers and be part of a broader initiative\n Get to mentor other developers from the industry and learn from them\n Learn new tools, technologies and languages (Different and diverse programming languages and perspectives are appreciated). Kudos to the person who can implement the Game of Life in Stored Database Procedures :)\n Come up with your own game plan and learn about concepts such as code coverage, pair programming, good design and happy coding.\n Hopefully this will be the first of many events that will eventually gear into other Hacking / Open Source Initiatives.\n And remember, we are all here to learn. So if you havent put on that programming cap in a while, now is the best time to brush up on resources. Creative and novel approaches will be applauded.\n \n Looking forward to your presence at 11:00 am on Saturday[14th December, 2013]. Location Details are available here: http://www.acit.com/contact/\n \n And dont forget to RSVP at http://archive.coderetreat.org/events/gdcr-2013-karachi\n \n Looking forward to your Arrival\n \n Basit Ali (Software Developer)\n bali@acit.com\n 03332470654\n \n Iqbal Talaat (Software Developer)\n italaat@acit.com\n http://about.me/iqqi\n 03228485525\n \n Noman Ali (Software Developer)\n noman.ali@acit.com\n 03332421343\n\nhttps://www.dropbox.com/sh/317kz2m34tp90cl/rC3LQrwMuz/Code%20Retrea... (https://www.dropbox.com/sh/317kz2m34tp90cl/rC3LQrwMuz/Code%20Retreat%2012)\nwhere can i find the code samples ?\n@Kamal. Thank you for sharing last years pictures \n@Qambar: The objective was to have a good time, share best programming practices and network. There will be a good mix of junior, mid level and senior developers. Languages we've used were Javascript, Java, Python, ObjectiveC and even Excel :). We didnt store the code from last year anywhere though. Looking forward to having you here, this year\ncan you do it on a google hangout so that i can attend from here as well ?\nThere is always mIRC chatroom presence and there are rotating video conference calls between locations where GDCR is being held. \nThat said, we should have no problems working something out. We'll keep this in mind when making arrangements. I'll also look into the possibility of setting up a video cast. \nStay tuned.","url":"https://web.archive.org/http://coderetreat.org/events/gdcr-2013-karachi","spoken_language":"","moderators":[{"name":"Iqbal Talaat Bhatti"}],"location":{"country":"Pakistan","city":"Karachi","coordinates":{"latitude":24.8614622,"longitude":67.0099388}},"date":{"start":"2013-12-14T11:00:00+05:00","end":"2013-12-14T18:00:00+05:00"}}
