{"title":"Global Day of Coderetreat 2014 - Raleigh/Durham, NC, USA","description":"Raleigh/Durham, NC is participating in the Global Day of Coderetreat 2014 (http://globalday.coderetreat.org/)! This event will be facilitated by Cory Foy (http://blog.coryfoy.com/) and hosted at The Iron Yard (http://theironyard.com/locations/raleigh-durham/) offices at the American Underground in downtown Durham. The awesome Smashing Boxes (http://smashingboxes.com/) will be sponsoring food and drinks!\n \nCoderetreat (http://archive.coderetreat.org/) is a day-long, intensive practice event focused on the fundamentals of software development and design.The unique coderetreat format (which eliminates the pressure of 'getting things done' and focuses on practicing basic principles of good design) has proven to be a highly effective (and fun) means of skill improvement. We focus on a single problem, leaving you free to explore different approaches, languages and designs.\n \n On November 15th, Coderetreats will be held at cities all over the world. To celebrate this significant event, we'll be participating in some global activities in addition to our normal Coderetreat activities. \nYou only need to bring a laptop with the development tools you require to write code using your chosen programming languages. We'll provide the rest!\n \nCheck out coderetreat.org (http://archive.coderetreat.org/) for further details on what to expect. And please contact me (Cory Foy) if you have any questions at foyc at cory foy dot com. It will be an awesome time! \nRegistration is available at https://www.eventbrite.com/e/global-day-of-code-retreat-2014-raleighdurham-tickets-13665073603","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-code-retreat-raleigh-durham","spoken_language":"","moderators":[{"name":"Cory Foy"}],"location":{"country":"United States of America","city":"Raleigh/Durham, NC","coordinates":{"latitude":35.8991678,"longitude":-78.86364019999999}},"date":{"start":"2014-11-15T08:30:00-04:00","end":"2014-11-15T16:30:00-04:00"}}
