{"title":"Global Day of Coderetreat 2016 - Portland, USA","description":"PDXWIT (http://www.pdxwit.org/) presents a woman-focused Coderetreat in honor of the Global Day of Coderetreat 2016. Coderetreat.org (http://archive.coderetreat.org/) is a self-organized, volunteer led organization dedicated to helping software developers help each other improve their craft. Tanya Crenshaw (https://www.linkedin.com/in/tanya-crenshaw-48457884) and Jean Richardson (https://www.linkedin.com/in/jean-richardson-6596a12) will be teaming up to facilitate PDXWIT (http://www.pdxwit.org/)'s 2016 Coderetreat. The Tech Academy (https://www.learncodinganywhere.com/) is donating space and providing breakfast and lunch for the event.  Come along for a day of codeplay in a supportive environment and help Coderetreat follow the sun during the global celebration of software development! \nRSVP at https://www.eventbrite.com/e/pdx-women-in-tech-pdxwit-coderetreat-2016-tickets-27661828273?aff=es2 \nHere's how it works: SW developers of all sorts gather together with their machines and IDE's ready to code Conway's Game of Life for 45 minute sessions. Pairs change with every 45 minute iteration so everyone gets exposed to different problem solving strategies, and everyone learns together:  newbies and master-craft persons alike. There is no expectation to finish coding Conway's Game of Life at any point during the day.  \nThe purpose is to learn coding problem solving strategies, share skills and experience pairing in a supportive environment.  \nPDXWIT (http://www.pdxwit.org/) a community-based non-profit organization with the purpose of strengthening the Portland women in tech community through educational programs, partnerships and events that provide information, connections, resources, opportunities, and a supportive environment for current and potential women in tech, all of whom are committed to helping each other. Our goal is to bring together and empower current women in tech and encourage others to pursue tech careers to help reduce gender imbalance in the industry and address the current negative effects of that imbalance on women.","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-coderetreat-5","spoken_language":"","moderators":[{"name":"Jean Richardson"}],"location":{"country":"United States of America","city":"Portland","coordinates":{"latitude":45.5230622,"longitude":-122.6764816}},"date":{"start":"2016-10-22T08:00:00-07:00","end":"2016-10-22T17:00:00-07:00"}}
