{"title":"Global Day of Coderetreat 2016 - Salt Lake City, Utah, United States of America (USA)","description":"Please RSVP via EventBrite (https://www.eventbrite.com/e/slc-global-day-of-code-retreat-2016-tickets-28614627120) \n \na day to celebrate passion and software craftsmanship \nEach year there’s a Saturday set aside where developers around the world gather in person or online to meditate on their coding. It’s one of those global vibration gigs where you can feel the focus and concentration bouncing back and forth from India to Indiana. Our meditation is code, and we set aside this day to merge intention with practice. \nCode Retreat is a “repeatable, day long event focused on practicing the fundamentals of software development.\" It’s an opportunity to learn (and re-learn) best practices, things like pairing with other developers and doing behavior driven development. Participants get together in some convenient location and go through a series of exercises that teach and reinforce various aspects of working together on a problem and writing tests. \nFor each exercise, the problem is always the same: work on solving Conway’s Game of Life. Sometimes, rarely, it actually gets solved, but that’s beside the point. In fact, at the end of each exercise, participants are supposed to delete their code and start over. \nCode Retreats can happen any time, anywhere, but they’re best experienced on a Global Day of Code Retreat. This year, it’ll be October 22, 2016, and there will be more than 115 Code Retreats world wide. In Salt Lake City, we're hosting one at O.C. Tanner Company. \nIn addition to hosting, O.C. Tanner will also sponsor food and beverages. We'll have morning snacks, a nice lunch (something that's not pizza), and afternoon snacks.  You're just responsible for bringing yourself and your computer. \nThis event will be facilitated by Sean Duncan, organizer of SLC JS Learners and SLC Iron Yard instructor, and Rob Martin, co-organizer of SLC Software Craftsmanship, speaker, and trainer. \nPark at the south end of the main building, and enter through the main entrance. \n \nPlease RSVP via EventBrite (https://www.eventbrite.com/e/slc-global-day-of-code-retreat-2016-tickets-28614627120)","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-coderetreat-2016-salt-lake-city-utah-united-states","spoken_language":"","moderators":[{"name":"Sean Duncan"}],"location":{"country":"United States of America (USA)","city":"Salt Lake City, Utah","coordinates":{"latitude":40.7607793,"longitude":-111.8910474}},"date":{"start":"2016-10-22T09:00:00-06:00","end":"2016-10-22T17:00:00-06:00"}}
