{"title":"Global Day of Code Retreat 2016 - Bucharest, Romania","description":"RSVP Meetup: https://www.meetup.com/The-Bucharest-Agile-Software-Meetup-Group/events/234321866/ \nHi all, \nThat day of the year, when programmers from all around the world celebrate together the joy of coding, has come. Global Day of Coderetreat (http://globalday.coderetreat.org/) is happening on 22nd October. Like every year, our community is participating at the event and is inviting you to practice your craft.  \nThis year, Alin Pandichi (http://twitter.com/alinpandichi/) is facilitating the coderetreat. You might know him from our previous meetups such as \"Bring Your Own Code\" and \"Coding Dojo\". He is also one of the Bucharest Java User Group organizers.  \nWe will gather in the city center at MozaicWorks (http://mozaicworks.com/) office, our sponsor for this edition. Places are limited, so don't forget to RSVP here: https://www.meetup.com/The-Bucharest-Agile-Software-Meetup-Group/events/234321866/ \nPrerequisites: \n- Bring a laptop on which you have a working development environment for your chosen programming language.  \n- Joy of coding :). \nAgenda: \n9:00 - 9:30 Welcome coffee \n9:30 – 10:00 Intro \n10:00 – 10:45 Session 1 \n10:45 – 11:00 Retrospective session 1 \n11:00 – 11:45 Session 2 \n11:45 – 12:00 Retrospective session 2 \n12:00 – 12:45 Session 3 \n12:45 – 13:00 Retrospective session 3 \n13:00 – 14:30 Lunch sponsored by Mozaic Works \n14:30 – 15:15 Session 4 \n15:15 – 15:30 Retrospective session 4 \n15:30 – 16:15 Session 5 \n16:15 – 16:30 Retrospective session 5 \n16:30 – 17:15 Session 6 \n17:15 – 17:30 Retrospective session 6 \n17:30 – 17:45 Closing circle with beer \nAfter 18:00 Other closing beers in the town \n======================================== \nGlobal Day of Coderetreat is a world-wide event celebrating passion and software craftsmanship. Last year, over 5000 passionate software developers in 200 cities around the world registered to spend the day practicing the craft of software development using the coderetreat format (http://archive.coderetreat.org/). Since our community pioneered code retreats in Europe, we are glad to continue this tradition. For more details please visit http://globalday.coderetreat.org/. \nWhat's it about? \nIn our day to day jobs we have the sense of wanting to get it done, that causes to rush. And so we try to cut corners, but sometimes we do not cut the corners in the best way because we do not know enough. \nDuring a code retreat we use pair-programming, which is wonderful because you can learn a lot from each other. We write our code using TDD and the known design rules. We focus purely on writing beautiful code, there is no pressure to actually produce a working solution for the problem. \nThe format of a code retreat is:  \n- take a problem: Conway’s Game of Life  \n- during 45 minutes sessions write the best code with your pair  \n- delete your code (yes, it can be hard)  \n- 10 minutes retrospectives  \n- 5 minutes break  \n- change your pair  \n- start a new 45 minutes session \nWe have 3 sessions in the morning, after that we have a lunch of 1h - 1h ½, and 3 more sessions in the afternoon. At the end we have a longer retrospective. \nThis code retreat is language agnostic, the main principles are the same for each language. \nSee you on 22nd October!","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-code-retreat-2016-bucharest-romania","spoken_language":"","moderators":[{"name":"Pandichi Alin-Ionut"}],"location":{"country":"Romania","city":"Bucharest","coordinates":{"latitude":44.4267674,"longitude":26.1025384}},"date":{"start":"2016-10-22T09:00:00+03:00","end":"2016-10-22T18:00:00+03:00"}}
