{"title":"Global Day of Coderetreat 2016 - Hyderabad, India","description":"Coderetreat is a day-long, intensive practice event, focusing on the fundamentals of software development and design. By providing developers the opportunity to take part in focused practice, away from the pressures of 'getting things done', the Coderetreat format has proven itself to be a highly effective means of skill improvement. Practicing the basic principles of modular and object-oriented design, developers can improve their ability to write code that minimizes the cost of change over time. \nFor an in-depth understanding of the philosophy behind a day of Coderetreat, please watch this introduction video. \nundefined () \nCleveland Code Retreat Introduction (http://vimeo.com/18955165) from Corey Haines (http://vimeo.com/coreyhaines) on Vimeo (http://vimeo.com/) \nOpen for all \nLimited to 30 participants \nYou can code in ANY LANGUAGE! \nParticipation Process:  \n1. If you like to participate in this full day event. Register yourselves in the online form \n2. After we get all the participating we filter and send you a confirmation mail. \n3. Reply back that you are going to attend. If you send us decline or not responding we hope you declined and we give seat to others. \n4. Come up with your laptop loaded with your known and/or to learn language + IDE + testing tool \nFAQ: \nI am student can i join this session? \nYES, all you going to do is basic core lanauge concept in the event. \nWhat language i can try? \nAny Language in this world from Java, .Net, Scala, etc to C, C++, Python etc. \nWhat i am going to do? \nDo not worry now, Just attend and see what you learn and the end of the day. \nWhat is this event all about? \nSoftware Craftsmanship!. We all have learnt many framework, tools, API etc but we have never mastered the tool we use! This is the place to text your skill of fundamentals of the language \nFundamentals of language? I am professional i have XX experience, what i will learn out of this? \nYou will learn what you have not learnt so far! \nHow best i can use this event? \nIf you have not learned any new language say Scala etc this is the time. We still have a month to go so take time and learn some basic of language like Scala or anything you like. Come to the event and work with others you learn more! \nApart from the global day of CodeRetreat Freebies, one participant going to get one year of free license of IntelliJ IDEA.","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-coderetreat-2016-hyderabad-india","spoken_language":"","moderators":[{"name":"Rajmahendra Hegde"}],"location":{"country":"India","city":"Hyderabad","coordinates":{"latitude":17.385044,"longitude":78.486671}},"date":{"start":"2016-10-22T09:00:00+05:30","end":"2016-10-22T16:00:00+05:30"}}
