{"title":"Global Day of Coderetreat 2016 - London, UK","description":"Registration: http://www.meetup.com/london-software-craftsmanship/events/234173628/\n \nWe are pleased to announce that Codurance together with LSCC is participating to the Global Day of Coderetreat. This year the event will happen on 22th of October.  \nLast year's Global Day of Coderetreat (http://globalday.coderetreat.org/timeline-2015.html) attracted over 2000 developers from more than 150 cities around the world. It's becoming a regular fixture in the global software development calendar, and by participating you will be a part of the history of software development: thousands of developers coming together around the world to practise their craft. \nNOTE: Please register for just one of them. LSCC is also organising other coderetreats ( Masabi ). Take the empty spots on a different coderetreat instead of adding yourself to a waiting list. \nBreakfast and lunch will be provided on the day. It's an early start, so sleep well the night before to help get those brain juices flowing. \nWatch our awesome video (8 mins) from GDCR 2012 for a better idea: vimeo.com/56026932 (http://t.co/XMNl0thnuK) \nIf you don't know what a coderetreat is, keep reading. \nWhat is a coderetreat? \nFrom the website: A Coderetreat is a day-long, intensive practice event, focusing on the fundamentals of software development and design. \nBy providing developers the opportunity to take part in focused practice, away from the pressures of 'getting things done', the coderetreat format has proven itself to be a highly effective means of skill improvement. Practising the basic principles of modular and object-oriented design, developers can improve their ability to write code that minimizes the cost of change over time. \nHow does it work? \nThe coderetreat day consists of 5-6 sessions, each session's learnings building upon previous sessions. The morning focuses on becoming comfortable with the problem domain, breaking old habits and beginning focused self-discovery. The afternoon pushes the envelope by challenging pairs to stretch their skills and understanding of abstractions, modular design and test-driven development. \nCoderetreat has an established, time-tested format that is optimized for focused practice. We will be working on implementing Conway's Game of Life in 45-minute sessions. In each one, you'll pair program in whichever language you like, using whichever technologies you and your pair prefer. \nThe day will start with breakfast at 8:30am and finish by 5 or 6pm. \nMore information \nVideo explaining the format: http://archive.coderetreat.org/about \nhttp://globalday.coderetreat.org/ \n (http://globalday.coderetreat.org/)http://archive.coderetreat.org/","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-coderetreat-2016-london-uk","spoken_language":"","moderators":[{"name":"Carlos Morera de la Chica"}],"location":{"country":"United Kingdom","city":"London","coordinates":{"latitude":51.5073509,"longitude":-0.1277583}},"date":{"start":"2016-10-22T09:00:00+01:00","end":"2016-10-22T16:00:00+01:00"}}
