{"title":"Global Day of Coderetreat 2015 - Bratislava, Slovakia","description":"Máš záujem zlepšiť si svoje písanie kódu?\nRád by si bol pri tom v kolektíve podobných ľudí?\n\nCoderetreat je zaujímavou možnosťou. Je to svetový deň, ktorý spája developerov. Udalosť zameraná na vývoj a dizajn softvéru založená na programovaní v pároch. \n\n\nCelý deň je rozdelený do 6-tich workshopov, počas ktorých riešime \"Conway’s Game of Life\". Páry sa menia každý workshop pre maximalizovanie odovzdania svojich zručností. Po každom workshope je kód vymazaný, čo dáva nasledovnému páru možnosť začať bez ovplyvnenia predchádzajúcim párom.\n\nMinulý rok sa v tento dátum realizovalo okolo 150 Coderetreat udalostí a participovalo 2000 účastníkov po celom svete \n\nNa stretnutie sa môžete sa prihlásiť cez: http://archive.coderetreat.org/events/global-day-of-coderetreat-2015-bratislava-slovakia.\n\nPočet účastníkov je limitovaný na 25. Obed bude k dispozícii zdarma.\n\n \n\nČo potrebujete:\n\n- Notebook s vývojárskym prostredím\n\n- Prečítať pravidlá Conway’s Game of Life (Wikipédia Game of Life)\n\n \n\nTešíme sa.\n\nGlobal Day of Coderetreat is an event held around the world to bring together developers to practice in advanced software development. Last year more than 2,000 developers from 150 cities all around the world joined the event.\n\n \n\nWhat is Coderetreat\n\nCodeRetreat is a one-day event based on TDD practices and pair programming.\n\nThe combination of pair programming with an emphasis on writing perfect code, not the solution to the problem, provides an excellent opportunity to gain and improve your programming skills in a company of other developers.\n\nThe whole day is divided into 6 sessions, 45 minutes each.\n\nDuring the sessions we solve Conway’s Game of Life. Pairs are changing after each session to maximize the knowledge transfer. After each session written code will be deleted. This gives a chance in each subsequent session to start again, not to be limited by previous decisions.\n\nParticipation is free of charge with preliminary registration on Coderetreat web-site or here.\n\n \n\nLimitation\nNumber of participants is limited to 25. The rest will be in a waiting list.\n\n \n\nTo participate you need:\n— Laptop with configured development environment (possibly one for two).\n— Know and understand TDD basics.\n— Read Conway’s Game of Life rules (Wikipedia on Game_of_Life).\n\n \n\nThe event is supported by Itera - an international company specializing in communication and technology \nRegistration (http://goo.gl/forms/7HZjePnyBd)","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-coderetreat-2015-bratislava-slovakia","spoken_language":"","moderators":[{"name":"Michael Dyrda"}],"location":{"country":"Slovakia","city":"Bratislava","coordinates":{"latitude":48.1485965,"longitude":17.1077477}},"date":{"start":"2015-11-14T10:00:00+02:00","end":"2015-11-14T17:00:00+02:00"}}
