{"title":"Global Day of Coderetreat 2015 - Arnhem, Netherlands","description":"Global Day of Code Retreat 2015, November 14 at Luminis Arnhem \nNovember 14, 2015, is this year's Global Day of Code Retreat (http://globalday.coderetreat.org/). This is a day for us, as developers, to hone our skills, share knowledge, and honor the craft of software engineering. \nLuminis Arnhem will facilitate a coderetreat at our offices in Arnhem. We will provide you with both the facilities and the necessary guidance to get the most out of this day. While we will provide you with exercises and training forms, we remain technology agnostics: you can do your training in any language and tool chain you--and your pair--like. \nWhat is a coderetreat? \nCoderetreat is a day-­long, intensive practice event focusing on the fundamentals of software development and design. The coderetreat format has proven itself to be a highly effective means of skill improvement by providing developers the opportunity to take part in focused practice away from the pressures of 'getting things done.' \nProgram \n09:30 Welcome & introduction \n10:00 3 training sessions: 45m of exercise, 10m retrospective, 5m break \n13:00 Lunch \n14:00 3 training sessions: 45m of exercise, 10m retrospective, 5m break \n16:45 Closing ceremony \n17:00 End \nContact \nTo sign up for this coderetreat, RVSP on this page. \nFor anything we should know about (for instance, you're a vegan), email walter.treur@luminis.eu (mailto:walter.treur@luminis.eu) .\n\nI want to attend, but it's the day after a full week of Devoxx so *fingers crossed*\n@Patrick. Have fun at Devoxx! I'll put you on the list just to make sure our security guard will let you through if you are able to attend. ;)","url":"https://web.archive.org/http://coderetreat.org/events/global-day-of-coderetreat-2015-arnhem-netherlands","spoken_language":"","moderators":[{"name":"Walter Treur"}],"location":{"country":"Netherlands","city":"Arnhem","coordinates":{"latitude":51.9851034,"longitude":5.898729599999999}},"date":{"start":"2015-11-14T09:30:00+02:00","end":"2015-11-14T17:00:00+02:00"}}
